<h1>Final Project Restaurant Ratings Analysis India

<h2>Importing Necssary Libraries

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import statistics as st
import seaborn as sns
import warnings 
from warnings import filterwarnings 
filterwarnings("ignore")

<h2>Loading Dataset

In [6]:
excel = pd.ExcelFile(r"C:\Data science\All Projects and Assignment\Excle projects\Final Project Restaurant Ratings Analysis India.xlsx")
print(excel.sheet_names)

['Consumers', 'Consumers preference', 'Restaurant', 'Rating', 'Restaurant Cuisines']

In [7]:
df = pd.read_excel(r"C:\Data science\All Projects and Assignment\Excle projects\Final Project Restaurant Ratings Analysis India.xlsx",
                   sheet_name="Consumers")

In [10]:
df = pd.read_excel(r"C:\Data science\All Projects and Assignment\Excle projects\Final Project Restaurant Ratings Analysis India.xlsx",
                   sheet_name="Consumers preference")

In [11]:
df = pd.read_excel(r"C:\Data science\All Projects and Assignment\Excle projects\Final Project Restaurant Ratings Analysis India.xlsx",
                   sheet_name="Restaurant")

In [12]:
df = pd.read_excel(r"C:\Data science\All Projects and Assignment\Excle projects\Final Project Restaurant Ratings Analysis India.xlsx",
                   sheet_name="Rating")

In [13]:
df = pd.read_excel(r"C:\Data science\All Projects and Assignment\Excle projects\Final Project Restaurant Ratings Analysis India.xlsx",
                   sheet_name="Restaurant Cuisines")

In [21]:
sheets = pd.read_excel(r"C:\Data science\All Projects and Assignment\Excle projects\Final Project Restaurant Ratings Analysis India.xlsx", sheet_name=None)

# Dictionary of DataFrames
df1 = sheets[list(sheets.keys())[0]]
df2 = sheets[list(sheets.keys())[1]]
df3 = sheets[list(sheets.keys())[2]]
df4 = sheets[list(sheets.keys())[3]]
df5 = sheets[list(sheets.keys())[4]]

In [18]:
df1

,Consumer_ID,City,State,Age,Gender,Occupation,Marital_Status,Smoker,Drink_Level,Budget_Level,Transport_Mode
0,C00001,Mumbai,Maharashtra,27,Female,Employed,Single,No,Casual,Medium,Bike
1,C00002,Delhi,Delhi,34,Male,Business,Married,Yes,Social,High,Car
2,C00003,Bengaluru,Karnataka,24,Female,Student,Single,No,Non,Low,Public Transport
3,C00004,Chennai,Tamil Nadu,30,Male,Employed,Married,No,Casual,Medium,Bike
4,C00005,Hyderabad,Telangana,37,Female,Business,Married,Yes,Social,High,Car
...,...,...,...,...,...,...,...,...,...,...,...
4995,C04996,Pune,Maharashtra,32,Male,Employed,Married,No,Casual,Medium,Bike
4996,C04997,Kolkata,West Bengal,34,Female,Business,Married,Yes,Social,High,Car
4997,C04998,Ahmedabad,Gujarat,24,Male,Student,Single,No,Non,Low,Public Transport
4998,C04999,Jaipur,Rajasthan,35,Female,Employed,Married,No,Casual,Medium,Bike
4999,C05000,Indore,Madhya Pradesh,37,Male,Business,Married,Yes,Social,High,Car

In [19]:
df2

     Consumer_ID Preferred_Cuisine
0         C00001            Indian
1         C00002           Chinese
2         C00003      South Indian
3         C00004      North Indian
4         C00005       Street Food
...          ...               ...
4995      C04996      North Indian
4996      C04997       Street Food
4997      C04998         Fast Food
4998      C04999       Continental
4999      C05000           Italian

[5000 rows x 2 columns]

In [22]:
df3

,Restaurant_ID,Restaurant_Name,City,State,Country,Price_Range,Pure_Veg,Alcohol_Served,Parking,Franchise,Online_Delivery
0,R00001,Delight Dhaba,Pune,Maharashtra,India,Low,No,Full Bar,Public,No,Yes
1,R00002,Delight Cafe,Chandigarh,Chandigarh,India,Low,No,No,Public,Yes,Yes
2,R00003,Plaza Kitchen,Delhi,Delhi,India,High,No,Full Bar,Private,No,No
3,R00004,House Restaurant,Patna,Bihar,India,Medium,No,Beer & Wine,Private,Yes,Yes
4,R00005,Heritage Palace,Bengaluru,Karnataka,India,Medium,Yes,No,Public,No,Yes
...,...,...,...,...,...,...,...,...,...,...,...
4995,R04996,Garden Bistro,Delhi,Delhi,India,Medium,No,Beer & Wine,Public,Yes,Yes
4996,R04997,Urban Palace,Amritsar,Punjab,India,Medium,Yes,No,Private,Yes,Yes
4997,R04998,Royal Palace,Mumbai,Maharashtra,India,High,No,No,Valet,Yes,No
4998,R04999,Classic Corner,Patna,Bihar,India,Medium,No,No,Public,No,Yes
4999,R05000,Green Dhaba,Noida,Uttar Pradesh,India,Medium,Yes,No,Public,No,Yes

In [23]:
df4

,Consumer_ID,Restaurant_ID,Overall_Rating,Food_Rating,Service_Rating,Value_for_Money
0,C00001,R03681,4,4,3,4
1,C00002,R00349,4,4,5,3
2,C00003,R02274,3,2,3,5
3,C00004,R00297,3,3,2,3
4,C00005,R04163,3,5,3,2
...,...,...,...,...,...,...
4995,C04996,R00791,3,2,5,3
4996,C04997,R04703,2,2,2,3
4997,C04998,R03950,4,4,5,2
4998,C04999,R03003,4,5,2,4
4999,C05000,R03957,4,4,2,5

In [24]:
df5

     Restaurant_ID Cuisine_Type
0           R00001       Bakery
1           R00002      Seafood
2           R00003     Gujarati
3           R00004      Bengali
4           R00005    Fast Food
...            ...          ...
4995        R04996       Kerala
4996        R04997    Chettinad
4997        R04998   Rajasthani
4998        R04999         Cafe
4999        R05000     Kashmiri

[5000 rows x 2 columns]

<h2>Understanding Dateset from all tables

This dataset constitutes the restaurant recommendation and rating system in India, integrating consumer demographics, preferences, restaurant details, cuisines, and ratings.
This is a relational dataset, with similarities to a real-world food delivery or restaurant review platform.

- The dataset contains 5 Tables
   - consumers
   - consumer preference
   - Restaurant
   - Ratings
   - Restaurant cuisines

<h3>Table 1 : Consumers

In [27]:
df1.shape

(5000, 11)

In [32]:
df1.columns

Index(['Consumer_ID', 'City', 'State', 'Age', 'Gender', 'Occupation',
       'Marital_Status', 'Smoker', 'Drink_Level', 'Budget_Level',
       'Transport_Mode'],
      dtype='object')

In [28]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Consumer_ID     5000 non-null   object
 1   City            5000 non-null   object
 2   State           5000 non-null   object
 3   Age             5000 non-null   int64
 4   Gender          5000 non-null   object
 5   Occupation      5000 non-null   object
 6   Marital_Status  5000 non-null   object
 7   Smoker          5000 non-null   object
 8   Drink_Level     5000 non-null   object
 9   Budget_Level    5000 non-null   object
 10  Transport_Mode  5000 non-null   object
dtypes: int64(1), object(10)
memory usage: 429.8+ KB

In [30]:
df1.dtypes

Consumer_ID       object
City              object
State             object
Age                int64
Gender            object
Occupation        object
Marital_Status    object
Smoker            object
Drink_Level       object
Budget_Level      object
Transport_Mode    object
dtype: object

In [33]:
df1.head()

,Consumer_ID,City,State,Age,Gender,Occupation,Marital_Status,Smoker,Drink_Level,Budget_Level,Transport_Mode
0,C00001,Mumbai,Maharashtra,27,Female,Employed,Single,No,Casual,Medium,Bike
1,C00002,Delhi,Delhi,34,Male,Business,Married,Yes,Social,High,Car
2,C00003,Bengaluru,Karnataka,24,Female,Student,Single,No,Non,Low,Public Transport
3,C00004,Chennai,Tamil Nadu,30,Male,Employed,Married,No,Casual,Medium,Bike
4,C00005,Hyderabad,Telangana,37,Female,Business,Married,Yes,Social,High,Car

In [37]:
df1.sample()

,Consumer_ID,City,State,Age,Gender,Occupation,Marital_Status,Smoker,Drink_Level,Budget_Level,Transport_Mode
990,C00991,Mumbai,Maharashtra,27,Female,Employed,Single,No,Casual,Medium,Bike

In [38]:
df1.tail()

,Consumer_ID,City,State,Age,Gender,Occupation,Marital_Status,Smoker,Drink_Level,Budget_Level,Transport_Mode
4995,C04996,Pune,Maharashtra,32,Male,Employed,Married,No,Casual,Medium,Bike
4996,C04997,Kolkata,West Bengal,34,Female,Business,Married,Yes,Social,High,Car
4997,C04998,Ahmedabad,Gujarat,24,Male,Student,Single,No,Non,Low,Public Transport
4998,C04999,Jaipur,Rajasthan,35,Female,Employed,Married,No,Casual,Medium,Bike
4999,C05000,Indore,Madhya Pradesh,37,Male,Business,Married,Yes,Social,High,Car

<h2>checking numeric and categorical columns

In [39]:
numeric_columns=df1.select_dtypes(["int64","float64"])
numeric_columns

      Age
0      27
1      34
2      24
3      30
4      37
...   ...
4995   32
4996   34
4997   24
4998   35
4999   37

[5000 rows x 1 columns]

In [43]:
numeric_columns.columns

Index(['Age'], dtype='object')

In [44]:
categorical_columns=df1.select_dtypes(["object"])
categorical_columns

,Consumer_ID,City,State,Gender,Occupation,Marital_Status,Smoker,Drink_Level,Budget_Level,Transport_Mode
0,C00001,Mumbai,Maharashtra,Female,Employed,Single,No,Casual,Medium,Bike
1,C00002,Delhi,Delhi,Male,Business,Married,Yes,Social,High,Car
2,C00003,Bengaluru,Karnataka,Female,Student,Single,No,Non,Low,Public Transport
3,C00004,Chennai,Tamil Nadu,Male,Employed,Married,No,Casual,Medium,Bike
4,C00005,Hyderabad,Telangana,Female,Business,Married,Yes,Social,High,Car
...,...,...,...,...,...,...,...,...,...,...
4995,C04996,Pune,Maharashtra,Male,Employed,Married,No,Casual,Medium,Bike
4996,C04997,Kolkata,West Bengal,Female,Business,Married,Yes,Social,High,Car
4997,C04998,Ahmedabad,Gujarat,Male,Student,Single,No,Non,Low,Public Transport
4998,C04999,Jaipur,Rajasthan,Female,Employed,Married,No,Casual,Medium,Bike
4999,C05000,Indore,Madhya Pradesh,Male,Business,Married,Yes,Social,High,Car

In [45]:
categorical_columns.columns

Index(['Consumer_ID', 'City', 'State', 'Gender', 'Occupation',
       'Marital_Status', 'Smoker', 'Drink_Level', 'Budget_Level',
       'Transport_Mode'],
      dtype='object')

<h2>Checking unique values in dataset

In [46]:
df1.nunique()

Consumer_ID       5000
City                10
State                9
Age                 19
Gender               2
Occupation           3
Marital_Status       2
Smoker               2
Drink_Level          3
Budget_Level         3
Transport_Mode       3
dtype: int64

In [47]:
numeric_columns.nunique()

Age    19
dtype: int64

In [48]:
categorical_columns.nunique()

Consumer_ID       5000
City                10
State                9
Gender               2
Occupation           3
Marital_Status       2
Smoker               2
Drink_Level          3
Budget_Level         3
Transport_Mode       3
dtype: int64

In [49]:
df1["City"].unique()

array(['Mumbai', 'Delhi', 'Bengaluru', 'Chennai', 'Hyderabad', 'Pune',
       'Kolkata', 'Ahmedabad', 'Jaipur', 'Indore'], dtype=object)

In [50]:
df1["State"].unique()

array(['Maharashtra', 'Delhi', 'Karnataka', 'Tamil Nadu', 'Telangana',
       'West Bengal', 'Gujarat', 'Rajasthan', 'Madhya Pradesh'],
      dtype=object)

In [51]:
df1["Gender"].unique()

array(['Female', 'Male'], dtype=object)

In [52]:
df1["Occupation"].unique()

array(['Employed', 'Business', 'Student'], dtype=object)

In [53]:
df1["Marital_Status"].unique()

array(['Single', 'Married'], dtype=object)

In [54]:
df1["Smoker"].unique()

array(['No', 'Yes'], dtype=object)

In [55]:
df1["Drink_Level"].unique()

array(['Casual', 'Social', 'Non'], dtype=object)

In [56]:
df1["Budget_Level"].unique()

array(['Medium', 'High', 'Low'], dtype=object)

In [57]:
df1["Transport_Mode"].unique()

array(['Bike', 'Car', 'Public Transport'], dtype=object)

<h2>Checking About Null Values

In [58]:
df1.isnull().sum()

Consumer_ID       0
City              0
State             0
Age               0
Gender            0
Occupation        0
Marital_Status    0
Smoker            0
Drink_Level       0
Budget_Level      0
Transport_Mode    0
dtype: int64

<h4>There is no null values are present in table

<h3>Table 2 : Consumers preference

In [61]:
df2.shape

(5000, 2)

In [62]:
df2.columns

Index(['Consumer_ID', 'Preferred_Cuisine'], dtype='object')

In [63]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Consumer_ID        5000 non-null   object
 1   Preferred_Cuisine  5000 non-null   object
dtypes: object(2)
memory usage: 78.3+ KB

In [65]:
df2.dtypes

Consumer_ID          object
Preferred_Cuisine    object
dtype: object

In [66]:
data.head()

,Consumer_ID,City,State,Age,Gender,Occupation,Marital_Status,Smoker,Drink_Level,Budget_Level,Transport_Mode
0,C00001,Mumbai,Maharashtra,27,Female,Employed,Single,No,Casual,Medium,Bike
1,C00002,Delhi,Delhi,34,Male,Business,Married,Yes,Social,High,Car
2,C00003,Bengaluru,Karnataka,24,Female,Student,Single,No,Non,Low,Public Transport
3,C00004,Chennai,Tamil Nadu,30,Male,Employed,Married,No,Casual,Medium,Bike
4,C00005,Hyderabad,Telangana,37,Female,Business,Married,Yes,Social,High,Car

In [67]:
data.sample()

,Consumer_ID,City,State,Age,Gender,Occupation,Marital_Status,Smoker,Drink_Level,Budget_Level,Transport_Mode
2141,C02142,Delhi,Delhi,23,Male,Student,Single,No,Non,Low,Public Transport

In [69]:
data.tail()

,Consumer_ID,City,State,Age,Gender,Occupation,Marital_Status,Smoker,Drink_Level,Budget_Level,Transport_Mode
4995,C04996,Pune,Maharashtra,32,Male,Employed,Married,No,Casual,Medium,Bike
4996,C04997,Kolkata,West Bengal,34,Female,Business,Married,Yes,Social,High,Car
4997,C04998,Ahmedabad,Gujarat,24,Male,Student,Single,No,Non,Low,Public Transport
4998,C04999,Jaipur,Rajasthan,35,Female,Employed,Married,No,Casual,Medium,Bike
4999,C05000,Indore,Madhya Pradesh,37,Male,Business,Married,Yes,Social,High,Car

- There is no numeric_columns 
- There is only categorical_columns

<h2>Checking Unique Values

In [70]:
df2.nunique()

Consumer_ID          5000
Preferred_Cuisine       8
dtype: int64

In [74]:
df2["Preferred_Cuisine"].unique()

array(['Indian', 'Chinese', 'South Indian', 'North Indian', 'Street Food',
       'Fast Food', 'Continental', 'Italian'], dtype=object)

<h2>Checking For Null Values

In [75]:
df2.isnull().sum()

Consumer_ID          0
Preferred_Cuisine    0
dtype: int64

<h4>There is no null values in table

<h3>Table 3 : Restaurant

In [77]:
df3.shape

(5000, 11)

In [81]:
df3.columns

Index(['Restaurant_ID', 'Restaurant_Name', 'City', 'State', 'Country',
       'Price_Range', 'Pure_Veg', 'Alcohol_Served', 'Parking', 'Franchise',
       'Online_Delivery'],
      dtype='object')

In [82]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Restaurant_ID    5000 non-null   object
 1   Restaurant_Name  5000 non-null   object
 2   City             5000 non-null   object
 3   State            5000 non-null   object
 4   Country          5000 non-null   object
 5   Price_Range      5000 non-null   object
 6   Pure_Veg         5000 non-null   object
 7   Alcohol_Served   5000 non-null   object
 8   Parking          4176 non-null   object
 9   Franchise        5000 non-null   object
 10  Online_Delivery  5000 non-null   object
dtypes: object(11)
memory usage: 429.8+ KB

In [84]:
df3.dtypes

Restaurant_ID      object
Restaurant_Name    object
City               object
State              object
Country            object
Price_Range        object
Pure_Veg           object
Alcohol_Served     object
Parking            object
Franchise          object
Online_Delivery    object
dtype: object

In [86]:
df3.head()

,Restaurant_ID,Restaurant_Name,City,State,Country,Price_Range,Pure_Veg,Alcohol_Served,Parking,Franchise,Online_Delivery
0,R00001,Delight Dhaba,Pune,Maharashtra,India,Low,No,Full Bar,Public,No,Yes
1,R00002,Delight Cafe,Chandigarh,Chandigarh,India,Low,No,No,Public,Yes,Yes
2,R00003,Plaza Kitchen,Delhi,Delhi,India,High,No,Full Bar,Private,No,No
3,R00004,House Restaurant,Patna,Bihar,India,Medium,No,Beer & Wine,Private,Yes,Yes
4,R00005,Heritage Palace,Bengaluru,Karnataka,India,Medium,Yes,No,Public,No,Yes

In [87]:
df3.sample()

,Restaurant_ID,Restaurant_Name,City,State,Country,Price_Range,Pure_Veg,Alcohol_Served,Parking,Franchise,Online_Delivery
4597,R04598,Taste House,Hyderabad,Telangana,India,Medium,Yes,No,Public,No,Yes

In [89]:
df3.tail()

,Restaurant_ID,Restaurant_Name,City,State,Country,Price_Range,Pure_Veg,Alcohol_Served,Parking,Franchise,Online_Delivery
4995,R04996,Garden Bistro,Delhi,Delhi,India,Medium,No,Beer & Wine,Public,Yes,Yes
4996,R04997,Urban Palace,Amritsar,Punjab,India,Medium,Yes,No,Private,Yes,Yes
4997,R04998,Royal Palace,Mumbai,Maharashtra,India,High,No,No,Valet,Yes,No
4998,R04999,Classic Corner,Patna,Bihar,India,Medium,No,No,Public,No,Yes
4999,R05000,Green Dhaba,Noida,Uttar Pradesh,India,Medium,Yes,No,Public,No,Yes

<h2>Checking Unique Values

In [91]:
df3.nunique()

Restaurant_ID      5000
Restaurant_Name     160
City                 20
State                14
Country               1
Price_Range           3
Pure_Veg              2
Alcohol_Served        3
Parking               3
Franchise             2
Online_Delivery       2
dtype: int64

In [94]:
df3["Restaurant_ID"].unique()

array(['R00001', 'R00002', 'R00003', ..., 'R04998', 'R04999', 'R05000'],
      dtype=object)

In [95]:
df3["Restaurant_Name"].unique()

array(['Delight Dhaba', 'Delight Cafe', 'Plaza Kitchen',
       'House Restaurant', 'Heritage Palace', 'Heritage Eatery',
       'Flavors Cafe', 'Urban Eatery', 'Kitchen Kitchen',
       'Flavors Eatery', 'Royal Restaurant', 'Taste House',
       'Green Corner', 'Urban Dhaba', 'Urban Bistro', 'Flavors House',
       'Garden Bistro', 'Heritage Dhaba', 'House Corner',
       'Spice Restaurant', 'Urban Restaurant', 'Spice Bistro',
       'Hub House', 'Kitchen Dhaba', 'Plaza Cafe', 'Heritage Kitchen',
       'Flavors Dhaba', 'Royal Kitchen', 'House Dhaba', 'House Kitchen',
       'Royal Cafe', 'Garden House', 'Taste Cafe', 'Delight Corner',
       'Express Bistro', 'Express Dhaba', 'Royal Dhaba', 'Kitchen Palace',
       'Garden Grill', 'Classic House', 'Kitchen Bistro', 'Green House',
       'Tandoori Grill', 'Taste Grill', 'Express Cafe',
       'Tandoori Kitchen', 'Green Grill', 'Green Cafe', 'Garden Eatery',
       'Tandoori Bistro', 'Kitchen Grill', 'Delight Eatery',
       'Flavors Kitchen', 'Taste Palace', 'Flavors Bistro',
       'Garden Palace', 'Classic Eatery', 'House Bistro', 'Spice Corner',
       'Green Bistro', 'Tandoori Cafe', 'Express Corner', 'House Palace',
       'Flavors Restaurant', 'Hub Grill', 'Hub Dhaba', 'Classic Grill',
       'Hub Eatery', 'Plaza House', 'Green Kitchen', 'Plaza Grill',
       'Green Eatery', 'Urban Corner', 'Hub Palace', 'Express Grill',
       'Kitchen House', 'Green Dhaba', 'Tandoori Eatery', 'Urban Palace',
       'Royal Corner', 'Hub Cafe', 'Urban Grill', 'Classic Dhaba',
       'Garden Restaurant', 'Urban House', 'Heritage Corner',
       'Delight Restaurant', 'Heritage Grill', 'Tandoori Corner',
       'Hub Bistro', 'Royal Grill', 'Urban Cafe', 'Heritage Bistro',
       'Classic Restaurant', 'House Grill', 'Heritage House',
       'Green Palace', 'Taste Restaurant', 'Green Restaurant',
       'Tandoori Dhaba', 'Kitchen Eatery', 'Classic Cafe', 'Plaza Bistro',
       'Delight Bistro', 'Spice Dhaba', 'Express House', 'Garden Dhaba',
       'Hub Restaurant', 'Royal Eatery', 'Plaza Palace', 'Royal Palace',
       'Classic Corner', 'Plaza Dhaba', 'Delight Palace', 'Hub Corner',
       'Spice Grill', 'Kitchen Corner', 'Heritage Cafe', 'Express Eatery',
       'House Cafe', 'Flavors Corner', 'Tandoori Palace', 'Spice Cafe',
       'Classic Kitchen', 'Flavors Grill', 'Garden Corner',
       'Classic Bistro', 'Kitchen Restaurant', 'Spice Eatery',
       'Heritage Restaurant', 'Express Restaurant', 'Royal Bistro',
       'Tandoori Restaurant', 'Hub Kitchen', 'Spice House', 'House House',
       'Kitchen Cafe', 'Plaza Restaurant', 'Spice Kitchen', 'Garden Cafe',
       'Delight House', 'Urban Kitchen', 'Delight Kitchen', 'Taste Dhaba',
       'Taste Kitchen', 'Classic Palace', 'House Eatery',
       'Flavors Palace', 'Plaza Eatery', 'Taste Corner', 'Express Palace',
       'Delight Grill', 'Garden Kitchen', 'Tandoori House',
       'Plaza Corner', 'Royal House', 'Taste Eatery', 'Express Kitchen',
       'Spice Palace', 'Taste Bistro'], dtype=object)

In [96]:
df3["City"].unique()

array(['Pune', 'Chandigarh', 'Delhi', 'Patna', 'Bengaluru', 'Ludhiana',
       'Gurgaon', 'Lucknow', 'Jaipur', 'Bhopal', 'Kolkata', 'Faridabad',
       'Chennai', 'Hyderabad', 'Noida', 'Mumbai', 'Kanpur', 'Amritsar',
       'Ahmedabad', 'Indore'], dtype=object)

In [97]:
df3["State"].unique()

array(['Maharashtra', 'Chandigarh', 'Delhi', 'Bihar', 'Karnataka',
       'Punjab', 'Haryana', 'Uttar Pradesh', 'Rajasthan',
       'Madhya Pradesh', 'West Bengal', 'Tamil Nadu', 'Telangana',
       'Gujarat'], dtype=object)

In [98]:
df3["Country"].unique()

array(['India'], dtype=object)

In [99]:
df3["Price_Range"].unique()

array(['Low', 'High', 'Medium'], dtype=object)

In [100]:
df3["Pure_Veg"].unique()

array(['No', 'Yes'], dtype=object)

In [101]:
df3["Alcohol_Served"].unique()

array(['Full Bar', 'No', 'Beer & Wine'], dtype=object)

In [102]:
df3["Parking"].unique()

array(['Public', 'Private', 'Valet', nan], dtype=object)

In [103]:
df3["Franchise"].unique()

array(['No', 'Yes'], dtype=object)

In [104]:
df3["Online_Delivery"].unique()

array(['Yes', 'No'], dtype=object)

<h2>Checking Null Values

In [105]:
df3.isnull().sum()

Restaurant_ID        0
Restaurant_Name      0
City                 0
State                0
Country              0
Price_Range          0
Pure_Veg             0
Alcohol_Served       0
Parking            824
Franchise            0
Online_Delivery      0
dtype: int64

<h3>Table 4 : Rating

In [109]:
df4.shape

(5000, 6)

In [110]:
df4.columns

Index(['Consumer_ID', 'Restaurant_ID', 'Overall_Rating', 'Food_Rating',
       'Service_Rating', 'Value_for_Money'],
      dtype='object')

In [111]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Consumer_ID      5000 non-null   object
 1   Restaurant_ID    5000 non-null   object
 2   Overall_Rating   5000 non-null   int64
 3   Food_Rating      5000 non-null   int64
 4   Service_Rating   5000 non-null   int64
 5   Value_for_Money  5000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 234.5+ KB

In [113]:
df4.dtypes

Consumer_ID        object
Restaurant_ID      object
Overall_Rating      int64
Food_Rating         int64
Service_Rating      int64
Value_for_Money     int64
dtype: object

In [117]:
df4.describe()

       Overall_Rating  Food_Rating  Service_Rating  Value_for_Money
count     5000.000000  5000.000000     5000.000000      5000.000000
mean         3.486400     3.498400        3.467000         3.484600
std          0.707612     1.105189        1.134182         1.128547
min          2.000000     2.000000        2.000000         2.000000
25%          3.000000     3.000000        2.000000         2.000000
50%          3.000000     4.000000        3.000000         3.000000
75%          4.000000     4.000000        5.000000         5.000000
max          5.000000     5.000000        5.000000         5.000000

In [118]:
df4.head()

,Consumer_ID,Restaurant_ID,Overall_Rating,Food_Rating,Service_Rating,Value_for_Money
0,C00001,R03681,4,4,3,4
1,C00002,R00349,4,4,5,3
2,C00003,R02274,3,2,3,5
3,C00004,R00297,3,3,2,3
4,C00005,R04163,3,5,3,2

In [119]:
df4.sample()

,Consumer_ID,Restaurant_ID,Overall_Rating,Food_Rating,Service_Rating,Value_for_Money
190,C00191,R01723,5,4,5,5

In [120]:
df4.tail()

,Consumer_ID,Restaurant_ID,Overall_Rating,Food_Rating,Service_Rating,Value_for_Money
4995,C04996,R00791,3,2,5,3
4996,C04997,R04703,2,2,2,3
4997,C04998,R03950,4,4,5,2
4998,C04999,R03003,4,5,2,4
4999,C05000,R03957,4,4,2,5

In [123]:
numeric_columns=df4.select_dtypes(["int64","float64"])
numeric_columns

      Overall_Rating  Food_Rating  Service_Rating  Value_for_Money
0                  4            4               3                4
1                  4            4               5                3
2                  3            2               3                5
3                  3            3               2                3
4                  3            5               3                2
...              ...          ...             ...              ...
4995               3            2               5                3
4996               2            2               2                3
4997               4            4               5                2
4998               4            5               2                4
4999               4            4               2                5

[5000 rows x 4 columns]

In [125]:
numeric_columns.columns

Index(['Overall_Rating', 'Food_Rating', 'Service_Rating', 'Value_for_Money'], dtype='object')

In [131]:
Categorical_columns=df4.select_dtypes(["object"])
Categorical_columns

     Consumer_ID Restaurant_ID
0         C00001        R03681
1         C00002        R00349
2         C00003        R02274
3         C00004        R00297
4         C00005        R04163
...          ...           ...
4995      C04996        R00791
4996      C04997        R04703
4997      C04998        R03950
4998      C04999        R03003
4999      C05000        R03957

[5000 rows x 2 columns]

In [132]:
Categorical_columns.columns

Index(['Consumer_ID', 'Restaurant_ID'], dtype='object')

<h2>Checking Unique Values

In [133]:
df4.nunique()

Consumer_ID        5000
Restaurant_ID      3181
Overall_Rating        4
Food_Rating           4
Service_Rating        4
Value_for_Money       4
dtype: int64

In [134]:
Categorical_columns["Restaurant_ID"].unique()

array(['R03681', 'R00349', 'R02274', ..., 'R03536', 'R03950', 'R03003'],
      dtype=object)

In [135]:
Categorical_columns["Consumer_ID"].unique()

array(['C00001', 'C00002', 'C00003', ..., 'C04998', 'C04999', 'C05000'],
      dtype=object)

<h2>Checking Null Values

In [136]:
df4.isnull().sum()

Consumer_ID        0
Restaurant_ID      0
Overall_Rating     0
Food_Rating        0
Service_Rating     0
Value_for_Money    0
dtype: int64

<h4>There is no null values in these table

<h3>Table 5 : Restaurant Cuisines

In [138]:
df5.shape

(5000, 2)

In [139]:
df5.columns

Index(['Restaurant_ID', 'Cuisine_Type'], dtype='object')

In [140]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Restaurant_ID  5000 non-null   object
 1   Cuisine_Type   5000 non-null   object
dtypes: object(2)
memory usage: 78.3+ KB

In [142]:
df5.dtypes

Restaurant_ID    object
Cuisine_Type     object
dtype: object

In [143]:
df5.head()

  Restaurant_ID Cuisine_Type
0        R00001       Bakery
1        R00002      Seafood
2        R00003     Gujarati
3        R00004      Bengali
4        R00005    Fast Food

In [144]:
df5.sample()

     Restaurant_ID Cuisine_Type
4622        R04623      Chinese

In [145]:
df5.tail()

     Restaurant_ID Cuisine_Type
4995        R04996       Kerala
4996        R04997    Chettinad
4997        R04998   Rajasthani
4998        R04999         Cafe
4999        R05000     Kashmiri

<h4>There Is no Numeric columns in this table

<h2>Checking Unique Values

In [146]:
df5.nunique()

Restaurant_ID    5000
Cuisine_Type       25
dtype: int64

In [147]:
df5["Restaurant_ID"].unique()

array(['R00001', 'R00002', 'R00003', ..., 'R04998', 'R04999', 'R05000'],
      dtype=object)

In [148]:
df5["Cuisine_Type"].unique()

array(['Bakery', 'Seafood', 'Gujarati', 'Bengali', 'Fast Food', 'Mexican',
       'Cafe', 'Rajasthani', 'Chinese', 'Kerala', 'BBQ', 'Punjabi',
       'Goan', 'Mughlai', 'Maharashtrian', 'North Indian', 'South Indian',
       'Street Food', 'Continental', 'Italian', 'Hyderabadi', 'Chettinad',
       'Awadhi', 'Indo-Chinese', 'Kashmiri'], dtype=object)

<h2>Checking Null Values

In [149]:
df5.isnull().sum()

Restaurant_ID    0
Cuisine_Type     0
dtype: int64

<h4>There Is no null Values In dataset

<h2>Transfering dataset python to myql

In [150]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\atharv\anaconda3\lib\site-packages (9.5.0)Note: you may need to restart the kernel to use updated packages.

In [151]:
import mysql.connector as connector
import pandas as pd

In [161]:
from sqlalchemy import create_engine
from urllib.parse import quote_plus

username = "root"
password = quote_plus("atharv@5104")
host = "localhost"
port = "3306"
database = "indian_restaurant"   # 🔥 must exist

engine = create_engine(
    f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}"
)

engine.connect()
print("MySQL connected successfully")

df1.to_sql("customer", engine, if_exists="replace", index=False)
print("Table created successfully")

MySQL connected successfully
Table created successfully

In [160]:
from sqlalchemy import create_engine
from urllib.parse import quote_plus

username = "root"
password = quote_plus("atharv@5104")
host = "localhost"
port = "3306"
database = "indian_restaurant"   # 🔥 must exist

engine = create_engine(
    f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}"
)

engine.connect()
print("MySQL connected successfully")

df2.to_sql("customer_preference", engine, if_exists="replace", index=False)
print("Table created successfully")

MySQL connected successfully
Table created successfully

In [159]:
from sqlalchemy import create_engine
from urllib.parse import quote_plus

username = "root"
password = quote_plus("atharv@5104")
host = "localhost"
port = "3306"
database = "indian_restaurant"   # 🔥 must exist

engine = create_engine(
    f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}"
)

engine.connect()
print("MySQL connected successfully")

df3.to_sql("restaurant", engine, if_exists="replace", index=False)
print("Table created successfully")

MySQL connected successfully
Table created successfully

In [158]:
from sqlalchemy import create_engine
from urllib.parse import quote_plus

username = "root"
password = quote_plus("atharv@5104")
host = "localhost"
port = "3306"
database = "indian_restaurant"   # 🔥 must exist

engine = create_engine(
    f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}"
)

engine.connect()
print("MySQL connected successfully")

df4.to_sql("rating", engine, if_exists="replace", index=False)
print("Table created successfully")

MySQL connected successfully
Table created successfully

In [157]:
from sqlalchemy import create_engine
from urllib.parse import quote_plus

username = "root"
password = quote_plus("atharv@5104")
host = "localhost"
port = "3306"
database = "indian_restaurant"   # 🔥 must exist

engine = create_engine(
    f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}"
)

engine.connect()
print("MySQL connected successfully")

df5.to_sql("restaurant_cuisines", engine, if_exists="replace", index=False)
print("Table created successfully")

MySQL connected successfully
Table created successfully